/*
자료구조를 직접 구현해봅시다 (언어는 C++)

[목표]
> 자료구조에 대한 이해 증진
> 엣지 케이스를 처리하는 프로그래밍 연습 목표


[자료구조]
1) 단순 구조: 정수, 실수, 문자, 문자열
2) 선형 구조
    > 순차 리스트
    > 연결 리스트 : 단순, 이중, 원형 --------- 직접구현 (단순) ---------- 개념정리(이중)
    > 스택 --------------------------------- 직접구현
    > 큐 ----------------------------------- 직접구현
    > 덱
    > 배열
3) 비선형 구조
    > 트리: 일반, 이진 ---------------------- 직접구현 (일반, 트리탐색), 개념정리 (이진, 레드블랙)
    > 그래프: 방향, 무방향 ------------------ 직접구현 (최단거리 탐색)
    > 해시테이블 ----------------------------------------------------- 개념정리
4) 파일 구조
    > 순차 파일
    > 색인 파일
    > 직접 파일

*/
